In [1]:
from pyhive import hive

In [2]:
# Establish connection to hive on docker
conn = hive.Connection(host="localhost", port=10000, username="hadoop")

In [5]:
# print all employees
cursor = conn.cursor()
cursor.execute("SELECT * FROM testdb.employee")
print(cursor.fetchall())

[(1, 'Rudolf Bardin', 30, 'cashier', 100, 'New York', 40000, 5), (2, 'Rob Trask', 22, 'driver', 100, 'New York', 50000, 4), (3, 'Madie Nakamura', 20, 'janitor', 100, 'New York', 30000, 4), (4, 'Alesha Huntley', 40, 'cashier', 101, 'Los Angeles', 40000, 10), (5, 'Iva Moose', 50, 'cashier', 102, 'Phoenix', 50000, 20)]

In [6]:
# Conditional SELECT querry with better formatting
cursor.execute("SELECT * FROM testdb.employee WHERE salary > 30000")
for result in cursor.fetchall():
    print(result)

(1, 'Rudolf Bardin', 30, 'cashier', 100, 'New York', 40000, 5)
(2, 'Rob Trask', 22, 'driver', 100, 'New York', 50000, 4)
(4, 'Alesha Huntley', 40, 'cashier', 101, 'Los Angeles', 40000, 10)
(5, 'Iva Moose', 50, 'cashier', 102, 'Phoenix', 50000, 20)

In [7]:
# Query with ORDER BY
cursor.execute("SELECT * FROM testdb.employee WHERE salary > 30000 ORDER BY salary")
for result in cursor.fetchall():
    print(result)

(4, 'Alesha Huntley', 40, 'cashier', 101, 'Los Angeles', 40000, 10)
(1, 'Rudolf Bardin', 30, 'cashier', 100, 'New York', 40000, 5)
(5, 'Iva Moose', 50, 'cashier', 102, 'Phoenix', 50000, 20)
(2, 'Rob Trask', 22, 'driver', 100, 'New York', 50000, 4)

In [8]:
# Query with COUNT
cursor.execute("SELECT COUNT(*) FROM testdb.employee WHERE salary > 45000")
for result in cursor.fetchall():
    print(result)

(2,)